In [3]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [5]:
np.random.seed(101)

In [10]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [11]:
df['W']

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [12]:
type(df['W'])

pandas.core.series.Series

In [13]:
df.W

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [15]:
df[['W','Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [17]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [23]:
df.drop('new',axis=1,inplace=True)

In [24]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [25]:
df.drop('E')

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [26]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [27]:
df.shape

(5, 4)

In [28]:
df.loc['A']

W    0.386030
X    2.084019
Y   -0.376519
Z    0.230336
Name: A, dtype: float64

In [29]:
df.iloc[0]

W    0.386030
X    2.084019
Y   -0.376519
Z    0.230336
Name: A, dtype: float64

In [32]:
df.loc['B','Y']

-0.031160481493099617

In [33]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [34]:
df>0

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [35]:
df[df>0]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [37]:
df['W']>0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [39]:
df['W']

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [40]:
df[df['W']>0]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [44]:
resultdf=df[df['W']>0]

In [46]:
resultdf['X']

A    2.084019
B    1.035125
E    1.192241
Name: X, dtype: float64

In [49]:
df[df['W']>0]['X']

A    2.084019
B    1.035125
E    1.192241
Name: X, dtype: float64

In [54]:
df[(df['W']>0) | (df['X']<1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
E  0.992573  1.192241 -1.046780  1.292765

In [56]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [64]:
newind='CA NY MH ON HE'.split()
newind

['CA', 'NY', 'MH', 'ON', 'HE']

In [66]:
df['States']=newind
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     MH
D -1.382920  1.482495  0.961458 -2.141212     ON
E  0.992573  1.192241 -1.046780  1.292765     HE

In [67]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     MH
D -1.382920  1.482495  0.961458 -2.141212     ON
E  0.992573  1.192241 -1.046780  1.292765     HE

In [68]:
df.set_index("States")

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
MH     -1.005187 -0.741790  0.187125 -0.732845
ON     -1.382920  1.482495  0.961458 -2.141212
HE      0.992573  1.192241 -1.046780  1.292765

In [69]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     MH
D -1.382920  1.482495  0.961458 -2.141212     ON
E  0.992573  1.192241 -1.046780  1.292765     HE